[
    {
        "basicInfo": {
            "plantName": "Indian Madder",
            "URLs": {
                "plantURL": "assets/IndianMadder.jpg",
                "plantCircleURL": "assets/CircleImage.jpg"
            }
        },
        "description": {
            "familyDescription": "Rubiaceae",
            "otherNameDescription": "Aromatic madder, Bengal madder, Indian madder, Madderwort, Rubia root, Munjeet",
            "usedPartDescription": "Roots, Leaves, Stems"
        },
        "boxes": {
            "boxDescription": "Madder Indian is a perennial climbing herb, that can grow to 1.5 m in height. The evergreen leaves are 5-10 cm long and 2-3 cm broad, produced in whorls of 4-7 starlike around the central stem. \nLeaves are ovate-heartshaped, entire, pointed, heart-shaped at base, rarely rounded, 3-9 palmately veined, upper surface mostly hairless and rough. It climbs with tiny hooks at the leaves and stems. The flowers are small, 3-5 mm across, with five greenish-yellow or pale yellow petals, in dense racemes. \nFruit is a small red to black berry, 4-6 mm diameter. The roots can be over a meter long, up to 12 mm thick.",
            "boxNutritionalValue": "Identification of aroma compounds in dried roots of Rubia cordifolia done by gas chromatography, accounting for 91.5% of total oil detected: \n\n● Mollugin 19.6% \n● Furomollugin 17.4%  \n● Eugenol 12.7% \n● (E)-anethole 10.6% \n● 4-tert-butyl-2-phenyl phenol 9.9% \n● Menthol 2.7%\n\nInformation on the nutritional value is limited. Further study should be done.",
            "boxHealthBenefits": "1- Anti-cancer:\nIndian madder has traditionally been used to treat uterine and ovarian cancers. It can act against cancer cells in the colon, breast, and liver. It also has anti-tumour activity against various cancers such as myeloid leukaemia and histolytic lymphoma. The cyclic hexapeptides and quinones present in this plant may responsible for its anti-cancer activity. The methanol fraction of the plant extract exhibited potent inhibition of human cervical cancer cell line and larynx carcinoma cell line. Thus, Indian madder can be a source of potent pharmacophore for cancer.\n\n2- Anti-inflammatory:\nIndian madder is an anti-inflammatory herb that is effective in treating inflammatory associated with arthritis or any other forms of joint pains. It is important for inflammation to be stopped because inflammation is an early stage of most diseases.\n\n3- Treats Diarrhea:\nIndian madder is very useful to treats diarrhea. It improves digestive fire due to its appetizer and digestive properties. This makes the stool thick and reduces the frequency of motion. It also controls bleeding because of its astringent nature.\n\n4- Treats Urolithiasis:\nIndian madder helps to treat urolithiasis, which is kidney stones. This benefit is contributed by ruberythric acid in the plant, which is a substance that tones down calcium and magnesium as well as the formation of bladder stones in the long run. Indian madder is a good antispasmodic agent, which allows kidney stones to pass through the urinary system with less pain.\n\n5- Treats Cough:\nIndian madder helps to treats cough due to its expectorant properties that react very quickly. An expectorant is a medicine that encourages the release of sputum by the air passages. Sputum is a mixture of saliva and mucus formed in the respiratory tract, such as phlegm.\n\n6- Anti-arthritic:\nThe anthraquinones rich fraction of ethanolic extract of Indian madder has imperative anti-arthritic potential which is similar to aspirin, a standard non-steroidal anti-inflammatory drug.\n\n7- Heals Wounds:\nThe root extract of Indian madder is rich with wound healing property. The ethanolic extract and the hydrogel formulation of roots are effective in the functional recovery and healing of wounds as well as lead to histopathological alterations.\n\n9- Supports Stomach Health:\nIndian madder has both gastroprotective and ulcer healing properties. Triterpenoids present in root extracts are potent antiulcer and antioxidant compound.\n\nConsumption of Indian madder may reduce ulcer index, lipid peroxidation, and glutathione in stomach tissue.\n",
            "boxOtherUses": "- Red dye is obtained from the stems and the root. It is used for dyeing wool, silk, linen and cotton fabrics, as well as basket-making material.\n\n- Plant is traditionally grown in living fences in the northwestern Himalayas, where it helps to exclude livestock and other animals.\n\n- Juice of crushed fruits is bottled and used as green to bluish ink.\n\n- Ash of burnt stems and leaves is used as vegetable salt to soften vegetables when cooking in Tanzania.\n\n- Indian madder can be used as an ornamental climber, but in cultivated fields, it can behave as a troublesome weed.",
            "boxWarnings": "- Pregnant women should not take Indian madder internally. It might trigger menstruation and might lead to miscarriage.\n\n- Indian madder should not be used by nursing mothers and might cause breast milk to become red.\n\n- It may change the colour of the urine, saliva, perspiration, tears, and breast milk.\n\n- Indian madder supplements may interact with blood thinners like warfarin and coumadin.\n\n- There are also compounds in the plant that are known to cause cancer if taken orally. It can also cause restlessness and constipation. Use Indian madder using the recommended dosage."
        }
    },
    {
        "basicInfo": {
            "plantName": "Dandelion",
            "URLs": {
                "plantURL": "assets/Dandelion.jpg",
                "plantCircleURL": "assets/DandelionCircle.jpg"
            }
        },
        "description": {
            "familyDescription": "Asteraceae",
            "otherNameDescription": "Taraxacum officinale, Blowball, Cankerwort, Broad-Lobed Dandelion, Faceclock, Common Dandelion...",
            "usedPartDescription": "Leaves, Flowers, Root, Buds"
        },
        "boxes": {
            "boxDescription": "Dandelions are herbaceous and perennial plants which grow up to 40 cm high. The stem is light green to white which contains the milky sap. It is smooth and grows 5-40 cm high. They have irregular leaves that are oblanceolate, oblong or obovate with jagged tooth-shaped edges, 6-40 cm long and 0.7-15 cm wide. The leaves are dark green with smooth or glabrous texture. \nThe plant bears yellow to orange flowers during spring and fall. The flowers are disk-shaped, feathery and 2-5 cm in diameter. The fruit of Dandelions is called cypselae which are obovoid, ribbed and 3 mm long. The fruit is olive-green or olive-brown to greyish in colour. Each fruit possesses white and single seeds.",
            "boxNutritionalValue": "Nutrition value per 100 g:\n\n● Energy 45 Kcal (2% RDA)\n● Carbohydrates 9.20 g (7% RDA)\n● Protein 2.70 g (5% RDA)\n● Total Fat 0.70 g (3% RDA)\n● Dietary Fiber 3.50 g (9% RDA)\n● Folates 27 µg (7% RDA)\n● Niacin 0.806 mg (5% RDA)\n● Pantothenic acid 0.084 mg (1.5% RDA)\n● Pyridoxine 0.251 mg (19% RDA)\n● Riboflavin 0.260 mg (20% RDA)\n● Thiamin 0.190 mg (17% RDA)\n● Vitamin A 10161 IU (338% RDA)\n● Vitamin C 35 mg (58% RDA)\n● Vitamin E 3.44 mg (23% RDA)\n● Vitamin K 778.4 µg (649% RDA)\n● Sodium 76 mg (5% RDA)\n● Potassium 397 mg (8% RDA)\n● Calcium 187 mg (19% RDA)\n● Iron 3.10 mg (39% RDA)\n● Magnesium 36 mg (9% RDA)\n● Manganese 0.342 mg (15% RDA)\n● Phosphorus 66 mg (9% RDA)\n● Selenium 0.5 mg (1% RDA)\n● Zinc 0.41 mg (4% RDA)\n● Carotene-α 363 µg\n● Carotene-ß 5854 µg\n● Crypto-xanthin-ß 121 µg\n● Lutein-zeaxanthin 13610 µg",
            "boxHealthBenefits": "1- Support Bones Health:\nDandelion is rich in calcium which is vital for bone growth and strength. Dandelion also contains antioxidants such as luteolin and vitamin C that prevent bones from damage due to free radicals. \n\n2- Supports Liver Health:\nDandelion contains antioxidants such as luteolin and vitamin C which helps to maintain the liver function and treats the liver hemorrhage. \n\n3- Lowers Diabetes:\n The juice of dandelion stimulates insulin production from the pancreas by keeping a low level of blood sugar. It enhances the urination which eliminates the excess sugar from the body. Thus, consuming dandelion juice can prevent harmful spikes and plunges in diabetic people.\n\n4- Diuretic Action:\nThe diuretic properties in dandelion remove the toxic elements from the kidneys and urinary tract. The disinfectant properties in dandelion prevent microbial growth in the urinary tract.\n\n5- Skin Care:\n ­The sap of dandelion helps to treat the skin ailments which are the result of fungal and microbial infections. The sap is highly alkaline and possesses insecticidal, germicidal, and fungicidal properties. The sap can be applied on eczema, ringworm, itches and other skin conditions without any side effects. The juice of Dandelion is a great diuretic, detoxifier, antioxidant, and stimulant which are effective to treat acne. Dandelion juice helps to regulate the hormone secretion by increasing sweat and open up pores. This helps to remove the toxins in the form of urine and sweat. The external application of dandelion sap prevents microbial infection and reduces acne. Vitamin C in dandelion also speeds up the healing process by eliminating inflammation and scars.\n\n6- Aids Weight Loss:\n Urine contains about 4% fat so more urination leads to loss of more water as well as fats from the body. The diuretic effects of dandelion enhance urination and assists to lose weight without any side effects. Dandelion is used as sweeteners as it possesses low calories and does not contain unhealthy sugar.\n\n 7- Prevents Cancer:\n Vitamin C and luteolin are the antioxidants found in dandelion that helps to eradicate free radicals from the body. It helps to detoxify the body and prevent the development of tumours and cancers. Luteolin renders the development of cancer cells and also effectively helps with prostate cancer.\n\n 8- Treats Jaundice:\nDandelion is effective to counteract and treats jaundice. It enhances the health of the liver and regulates the production of bile. It has diuretic properties that enhance the urination which helps to remove the excess bile. Luteolin and vitamin C acts as antioxidant and disinfectant which counteracts with the viral infections. \n\n 9- Boosts Gall Bladder Function:\n Dandelions are effective to boost the function of the liver and gall bladder. It regulates the secretion of both organs.\n\n10- Prevent Constipation:\n Dandelion is rich in fibre which aids digestion and good intestinal health. It enhances the bowel movements as it adds bulk to the stool and reduces constipation and diarrhoea. Consuming dandelion can prevents gastrointestinal issues by regulating bowel movements. It also soothes the stomach and enhances the appetite.\n\n 11- Treats anaemia:\n Dandelion provides a good amount of vitamin, iron, and protein. Iron is a vital part of haemoglobin. Protein and vitamin B is essential for RBC formation and other blood components. It assists the anaemic patients to improve their condition.\n\n12- Maintains Blood Pressure:\nConsumption of dandelion juice increases the frequency and quantity of urination which helps to reduce the blood pressure. The fibre helps to reduce the cholesterol which increases the blood pressure. The presence of a high amount of potassium effectively reduces blood pressure by replacing sodium.",
            "boxOtherUses": "- The buds are eaten in omelettes, pancakes, fritters and schnap\n\n- Dandelion petals are served with rice as confetti over rice.\n\n- The young flowers are added to a salad for flavour and colour. The flowers are used as an ingredient in Arabic cake. The flowers can be made as jam. Dandelion flowers are used to make wines. The flowers, leaves and roots are used to make tea. Young leaves are consumed as salads. The stalks of the blanched leaf are eaten raw or cooked as a vegetable.\n\n - The sprouted seeds are used in salads.\n\n - The roots are consumed raw or cooked. The roasted roots are used to make dandelion coffee.",
            "boxWarnings": "- Eczema: \nPeople with eczema seem to have a higher chance of having an allergic reaction to dandelion. \n\n- Bleeding disorders: \nDandelion might slow blood clotting. Taking dandelion might increase the risk of bruising and bleeding in people with bleeding disorders.\n\n - Ragweed allergy: \nPeople who are allergic to ragweed and related plants (daisies, chrysanthemums, marigolds) might be more likely to be allergic to dandelion. \n\n - Kidney failure: \n Dandelion might reduce how much oxalate is released through urine."
        }
    },
    {
        "basicInfo": {
            "plantName": "Roselle",
            "URLs": {
                "plantURL": "assets/Roselle.jpg",
                "plantCircleURL": "assets/RoselleCircle.jpg"
            }
        },
        "description": {
            "familyDescription": "Malvaceae",
            "otherNameDescription": "Florida Cranberry, Guinea Sorrel, Hibiscus, Indian Sorrel, Jamaican Sorrel, Jamaica tea flower, Java Jute...",
            "usedPartDescription": "Calyces, Leaves, Stem, Flower"
        },
        "boxes": {
            "boxDescription": "Roselle is a broad-leaved, erect and branched annual herb, 2–2.5 m tall. It has a deep penetrating tap root with bulbous, smooth or nearly smooth, cylindrical, typically red stems with spiny hairs.\nLeaves are usually alternate, 7.5-12.5 cm long, green with reddish veins and long or short petioles. Leaves of young seedlings and upper leaves of older plants are simple; lower leaves are deeply 3- to 5- or even 7-lobed; the margins are toothed.\nFlowers are axillary, solitary, predominantly yellow and red, regular, pedicellate; epicalyx of about 12 reddish bracts, connate at base, 10–12 mm long; calyx 15–30 mm long (enlarging in fruit to 40 mm), 5 reddish, large, accrescent, fleshy sepals, all sepals fused at base.\nFruit of Roselle is normally dehiscent, 5-valved, non-fleshy, bright red ovoid capsule, 18–20 mm long by 15–18 mm wide. The fruit is green when young and turns into bright red as they mature and consists of 5 valves with each valve containing 3-4 seeds. Later capsule turns brown and split open when completely mature and dry. Seeds are normally kidney-shaped, light brown, 3-5 mm long and covered with minute stout and stellate hairs. The fruit has a tart fruity flavour similar to a cranberry, rhubarb and red currant.",
            "boxNutritionalValue": "Nutrition value per 100 g:\n\n● Energy 49 kcal\n● Carbohydrates 11.31 g\n● Fat 0.64 g\n● Protein 0.96 g\n● Vitamin A 14 μg\n● Thiamine (B1) 0.011 mg\n● Riboflavin (B2) 0.028 mg\n● Niacin (B3) 0.31 mg\n● Vitamin C 12 mg\n● Calcium 215 mg\n● Iron 1.48 mg\n● Magnesium 51 mg\n● Phosphorus 37 mg\n● Potassium 208 mg\n● Sodium 6 mg",
            "boxHealthBenefits": "1- Reduces High Blood Pressure:\nRoselle has a high content of anthocyanins and potassium. The vivid colouring of hibiscus flowers can be attributed to anthocyanins, which also decrease blood pressure to manageable levels. In addition, anthocyanins can lower bad or low-density lipoprotein (LDL) levels without affecting good or high-density lipoprotein (HDL) cholesterol. Potassium, on the other hand, relaxes the blood vessels and ensures that blood is able to flow through them smoothly.\n\n2- Weight Loss:\nRoselle is beneficial for weight loss. The roselle extract inhibits the production of amylase, which helps in the absorption of carbohydrates and starch (dietary components that can lead to weight gain).\n\n3- Lowers Cholesterol Level:\nConsumption of roselle lowers cholesterol, triglycerides, and low-density lipoprotein cholesterol and increases (good) high-density lipoprotein cholesterol. Thus, roselle helps to reduce the chances of the body to get cholesterol-related diseases.\n\n 4- Protects the Liver:\nThe antioxidant properties of roselle may help in treating liver diseases. Antioxidants help protect the body from diseases by neutralizing the free radicals present in body tissues and cells. \n\n 5- Anticancer:\n Roselle contains hibiscus protocatechuic acid, which has antitumor and antioxidant properties. Roselle may slow down the growth of cancerous cells specifically skin, and gastric cancer cells as well as leukaemia cells by inducing apoptosis, commonly known as programmed cell death.\n\n 6- Anti-inflammatory and Antibacterial Agent:\n Roselle is rich with ascorbic acid, also known as vitamin C. It is an essential nutrient required by the body to boost and stimulate the activity of the immune system. Roselle is also known for its anti-inflammatory and antibacterial properties. Thus, it can help protects from cold and flu. It may also be used to treat discomfort caused by fever, due to its cooling effect.\n\n7- Relieves Menstrual Pain:\nRoselle provides relief from cramps and menstrual pain. It helps in restoring hormonal balance as well, which can reduce the symptoms of menstruation such as mood swings, depression, and overeating.\n\n 8- Antidepressant:\nRoselle contains flavonoids, which have been associated with antidepressant properties. Consumption of roselle may help calm down the nervous system, and it may reduce anxiety and depression by creating a relaxed sensation in the mind and body. \n\n 9- Improves Digestion:\n Consumption of roselle improves digestion as it regularizes both urination and bowel movements. Since roselle has diuretic properties, it also used to treat constipation, improve the health of the gastrointestinal system, and reduce the risk of colorectal cancer.",
            "boxOtherUses": "- Food:\nThis plant is quite famous for its many and fleshy calyces. The fresh calyces of red roselle are used to produce a bright red-coloured, nice-tasting drink called the roselle juice or flor de jamaica. Also, some folks use the leaves of the roselle in their salads. When the roselle leaves are used in salads, they add a taste that is akin to spicy spinach mixed with some sour fruitiness. These leaves always add an exciting flavour. The dried calyces and as well as the dried flower is also used as an essential ingredient in various recipes.\n\n- Skin Care:\nWith a reputation for anti-ageing properties, the roselle plant is essential in the beauty and skincare world. It has been used to make a face/body scrubs, facial steams, and clay masks. The roselle flowers are beneficial because of the antioxidants that they possess which help to neutralize the effects of free radicals.\n\n- Ornamental:\n Primarily, the Roselle is a flower, and so one of its primary uses is as part of flower arrangements.\n\n- Powdered calyces are used as an aphrodisiac on the penis.\n\n- Leaf juice is used as an eye drop.\n\n - Roselle is an annual multi-use crop used in food, animal feed, nutraceuticals, cosmeceuticals and pharmaceuticals. \n\n-  The strong bast fibre obtained from the stem is used for various household purposes including making sackcloth, gunnies, twine, ropes, cord and cordage, and as a substitute for jute in the manufacture of burlap.    \n\n - A yellow dye is obtained from the petals.\n\n - Seeds are fed to cattle in some parts of Africa and poultry.\n\n- Seed yields 20% oil which is useful as a lubricant.",
            "boxWarnings": "- With short-term, moderate use, roselle appears to be well tolerated. Higher doses may cause toxicity.\n\n- Roselle also interacts with other herbs and drugs. Application of roselle together with hydrochlorothiazide (a drug used to treat high blood pressure) causes several adverse effects, including a significant increase in the volume of urine excreted and a decrease in the pH of urine and the concentrations of several electrolytes (chemicals that must be in balance to help regulate important body functions)."
        }
    },
    {
        "basicInfo": {
            "plantName": "Pot Marigold",
            "URLs": {
                "plantURL": "assets/PotMarigold.jpg",
                "plantCircleURL": "assets/PotMarigoldCircle.jpg"
            }
        },
        "description": {
            "familyDescription": "Asteraceae",
            "otherNameDescription": "Calendula officinalis, Pot marigold, Ruddles, Common marigorld, Scotch marigold",
            "usedPartDescription": "Florets"
        },
        "boxes": {
            "boxDescription": "Calendula officinalis is a short-lived aromatic herbaceous perennial, growing to 80 cm (31 in) tall, with sparsely branched lax or erect stems. The leaves are oblong-lanceolate, 5–17 cm long, hairy on both sides, and with margins entire or occasionally waved or weakly toothed. The inflorescences are yellow, comprising a thick capitulum or flowerhead 4–7 cm diameter surrounded by two rows of hairy bracts; in the wild plant they have a single ring of ray florets surrounding the central disc florets. \nThe disc florets are tubular and hermaphrodite, and generally of a more intense orange-yellow colour than the female, tridentate, peripheral ray florets. \nThe flowers may appear all year long where conditions are suitable. The fruit is a thorny curved achene and weight in average 10.1 mg.",
            "boxNutritionalValue": "These petals contain high levels of antioxidants in the form of carotenoids and flavonoids. Calendula contains both lutein and beta-carotene, which the body absorbs and converts into vitamin A.\nIt also has fatty acids, with the two dominant fatty acids being calendic and linoleic acids. Additionally, the flower heads are rich in oxygenated oils like monoterpenes and sesquiterpenes.\n\nThe petals and pollen of Calendula officinalis contain triterpenoid esters and the carotenoids flavoxanthin and auroxanthin (antioxidants and the source of the yellow-orange coloration). The leaves and stems contain other carotenoids, mostly lutein (80%), zeaxanthin (5%), and beta-carotene.",
            "boxHealthBenefits": "1- Possesses Anti-Inflammatory Capabilities:\nCalendula has been found to have strong anti-inflammatory properties via powerful flavonoids. These plant-based antioxidants protect cells from free radical damage and pro-inflammatory compounds like C-reactive protein and cytokines.\nAnti-inflammatory linoleic acid is also found in high concentrations in calendula. Its powerful anti-inflammatory properties make it a potent remedy for all kinds of inflammatory, issues like diaper rash, dermatitis, ear infections, ulcers, sore throats and more. Ear drops containing calendula are sometimes used to treat ear infections in children as well.\n\n2- Calms Muscle Spasms:\nCalendula can help prevent and relax muscle spasms. Data from one study conducted by the Department of Biological and Biomedical Sciences at the Aga Khan University Medical College in Pakistan showed that the crude extract of its flowers relaxed spontaneous muscle contractions. This research additionally provided a scientific base for this herb’s traditional use in abdominal cramps and constipation.\n\n3- Heals Ulcers, Wounds & Hemorrhoids:\nIn studies done for slow-healing wounds and various exposed ulcers, it was found that using calendula-based gels and topical ointments helped speed up recovery rate and healing. In one study, it was found that animals treated within an eight-day window using the treatment had a 90 percent closure of their wounds, as compared to only 51 percent of those who had not used the plant-based topical treatment.\n\n4- Aids Menstruation:\nDrinking calendula tea may help induce the menstruation cycle, as well as ease the painful side effects of menstruation in women, primarily PMS cramps. The large flavonoids presence helps relax muscles, blood flow and information, all promoting an ease of the menstruation. It can also even alleviate hot flashes.\n\n 5- Contains Antimicrobial & Antiviral Components:\n The acids held within the oils of this plant have powerful antimicrobial and antiviral effects, especially when fortified with sunflower oil. The oils and acids within the plant have shown to be effective in fighting pathogens, as well as candida symptoms and even antibiotic resistant strains of bacteria! This is a big reason why it’s used in antiseptic topical products today.\n\n 6- Improves Oral Health:\nCalendula has become a popular additive in toothpastes and mouthwashes over the past years due to its powerful antibacterial and antimicrobial properties. It helps reduce gum inflammation as well as fight against gingivitis, cavities, plaque and more. It’s also an astringent, which helps fight mouth bacteria and promote a healthy oral environment.\n\n 7. Discourages Cancer:\n Due to its anti-inflammatory properties, calendula can help fight against cancer and irritation due to cancer treatments like chemotherapy and radiation. Animal studies have shown that it not only fights carcinogenic activity within tumors, but it also activates the lymphocytes, which fight against foreign and infectious invaders.\n\n According to research published in the Journal of Clinical Oncology, calendula appears more effective than typically recommended topical agents at reducing and preventing the incidence of dermatitis caused by radiation used for breast cancer treatment.",
            "boxOtherUses": "- It's often used to add color to salads or added to dishes as a garnish and in lieu of saffron. The leaves are edible but are often not palatable. They have a history of use as a potherb and in salads.\n\n- Flowers were used in ancient Greek, Roman, Middle Eastern, and Indian cultures as a medicinal herb, as well as a dye for fabrics, foods, and cosmetics. Many of these uses persist today. They are also used to make oil that protects the skin.\n\n- The flowers are considered sacred in India, where they’re used to adorn statues of deities, as well as used in religious ceremonies in ancient Aztec and Mayan civilizations. They’re also still used during processions on the Day of the Dead in Mexico.\n\n- Plant extracts are widely used by cosmetics, presumably due to presence of compounds such as saponins, resins, and essential oils.",
            "boxWarnings": "- Pot marigold may cause an allergic reaction in people who are sensitive to the Asteraceae/Compositae family. Members of this family include ragweed, chrysanthemums, marigolds, daisies, and many others. If you have allergies, be sure to check with your healthcare provider before taking calendula.\n\n- There is not enough reliable information about the safety of using calendula if you are breast-feeding or pregnant. Stay on the safe side and avoid use."
        }
    },
    {
        "basicInfo": {
            "plantName": "Aloe Vera",
            "URLs": {
                "plantURL": "assets/AloeVera.jpg",
                "plantCircleURL": "assets/AloeVeraCircle.jpg"
            }
        },
        "description": {
            "familyDescription": "Asphodelaceae",
            "otherNameDescription": "AloeVera, Barbados aloe, First Aid Plan, Medicinal Aloe",
            "usedPartDescription": "Nectar, Leaves"
        },
        "boxes": {
            "boxDescription": "Aloe vera is a succulent plant species of the genus Aloe. An evergreen perennial, it originates from the Arabian Peninsula but grows wild in tropical climates around the world and is cultivated for agricultural and medicinal uses. The species is also used for decorative purposes and grows successfully indoors as a potted plant.\n\nIt is found in many consumer products including beverages, skin lotion, cosmetics, or ointments for minor burns and sunburns. There is little scientific evidence of the effectiveness or safety of Aloe vera extracts for either cosmetic or medicinal purposes. Studies finding positive evidence are frequently contradicted by other studies.\n\nAloe vera is a stemless or very short-stemmed plant growing to 60–100 cm tall, spreading by offsets. The leaves are thick and fleshy, green to grey-green, with some varieties showing white flecks on their upper and lower stem surfaces.\nThe margin of the leaf is serrated and has small white teeth. The flowers are produced in summer on a spike up to 90 cm tall, each flower being pendulous, with a yellow tubular corolla 2–3 cm long. Like other Aloe species, Aloe vera forms arbuscular mycorrhiza, a symbiosis that allows the plant better access to mineral nutrients in soil.",
            "boxNutritionalValue": "Serving Size 100 g\n\n● Energy 15 kcal\n● Water 96.23 g\n● Protein 0 g\n● Total lipid (fat) 0 g\n● Carbohydrate 3.75 g\n● Fiber 0 g\n● Sugars 3.75 g\n● Calcium 8 g mg\n● Iron 0.15 mg\n● Magnesium 0 mg\n● Phosphorus 0 mg\n● Potassium0 mg\n● Sodium 8 mg",
            "boxHealthBenefits": "1- Helps Relieves Heartburn\n One of the most well establishes uses for the gel of the aloe Vera leaves is for its soothing action of stomach acidity. Indeed, the gel is alkaline in nature, helping to neutralize excess acidity and discomfort. This can promote healing of stomach ulcers, or just the discomfort that arises from chronic acid indigestion. Upon ingestion, aloe Vera gel causes a cooling sensation that even antacids can’t match.\n\n 2- Speeds Up Burn Healing:\n Burns are complex to deal with, as you have to balance controlling bacterial infestation with natural healing and trying to soothe discomfort as much as possible. While aloe Vera gel application has been used traditionally for centuries to heal burns, it would be smarter to use it as an adjuvant to other medical therapies for burn management. The cooling sensation of aloe Vera gel makes it perfect to apply when barrier dressings are not indicated (such as ointments), as it still allow the skin to naturally cool and breathe.\n\n 3- Helps Alleviate Menstrual Pain:\nDuring a woman’s menstrual cycle, the uterus typically contracts in pulsatile, painful fashion to get rid of unfertilized egg. This pain can range from minor to debilitating from woman to woman, but what is almost universal is the desire to numb the pain. One way to do so is to use an anti-spasmodic that reduces the frequency of unwanted cramps. Aloe Vera consumption can act via this mechanism, reducing overall pain load.\n\n 4- Can Reduce Inflammation:\n Aloe Vera is well known to possess numerous anti-inflammatory properties, being able to relieve symptoms of irritable bowel syndrome and even joint related inflammation. This also helps reduce pain associated with these conditions, allowing the individual a more comfortable life. Topical application of aloe Vera also helps relieve pain and swelling of joints, and explains why more topical pain medications are including aloe Vera in their preparations.\n\n 5- Helps Treat Dehydration:\n More than 50% of the world’s population suffers from chronic dehydration, though they are none the wiser. Aloe Vera can help with this, as the plant is very densely water based, and helps hydrate you better than water itself. This could be due to the aloe Vera gel itself, which helps retain water. Aloe Vera juice also naturally contains potassium, and can be compared to coconut water for its utility in helping maintain blood fluid balance. Regardless of your choice, just be sure to get enough water each day.\n\n6- Assists In The Body’s Detoxification Process:\nThe high water content of aloe Vera is perfect for maintaining optimal kidney function, but did you know that it also assists with the liver’s detoxification of waste? Closely related to the cucumber in its water content, aloe Vera juice is quickly becoming a favorite when it comes to detoxifying the liver. The phytonutrients found in aloe Vera also helps to reset liver enzymes which may have become elevated.\n\n7- Helps Treat Constipation:\nAs mentioned, aloe Vera is composed of primarily water, which makes it ideal to help with short term, occasional constipation. This type of irregularity is normally due to dehydration, and causes the body to recycle water from waste into circulation where cells may need it. This water loss result in compacting of feces, so that it becomes hard to move through the colon. However, as water intake in increased, water once more is allocated to waste removal and you experience a normal stool.\n\n8- It’s Consumption Is Good For Your Gut Microbiome:\nThe gut and intestines is teeming with bacteria, both good and bad, which assist in metabolism and our overall health. The key, however, is to keep colonies of good bacteria high, and control bad ones, so that they do not overgrow and cause ill-effects. Aloe Vera gel contains a type of soluble fiber which these bacteria thrive on. The more that is made available, the greater these colonies of bacteria can grow. These bacteria also help prevent constipation and diarrhea, and are an integral part of our digestive system.\n\n9- Helps Manage Diabetes:\nStud",
            "boxOtherUses": "The leaf extracts are used in skin-care cosmetic products. \nPlants have been grown indoors in pots in order to help remove toxins from the atmosphere. \nIt is also unusual in that it continues to release oxygen and absorb carbon dioxide in the dark, making it very suitable for growing in bedrooms.",
            "boxWarnings": "1- Pregnancy or breast-feeding: \nAloe -- either gel or latex -- is POSSIBLY UNSAFE when taken by mouth. There is a report that aloe was associated with miscarriage. It could also be a risk for birth defects. Do not take aloe by mouth if you are pregnant or breast-feeding. \n\n 2- Children: \n Aloe gel is POSSIBLY SAFE when applied to the skin appropriately. Aloe latex and aloe whole leaf extracts are POSSIBLY UNSAFE when taken by mouth in children. Children younger than 12 years-old might have stomach pain, cramps, and diarrhea. \n\n3- Diabetes: \nSome research suggests that aloe might lower blood sugar. If you take aloe by mouth and you have diabetes, monitor your blood sugar levels closely. \n\n4- Intestinal conditions such as Crohn's disease, ulcerative colitis, or obstruction: \n Do not take aloe latex if you have any of these conditions. Aloe latex is a bowel irritant. Remember, products made from whole aloe leaves will contain some aloe latex. \n\n 5- Hemorrhoids: \n Do not take aloe latex if you have hemorrhoids. It could make the condition worse. Remember, products made from whole aloe leaves will contain some aloe latex. \n\n 6- Kidney problems: \n High doses of aloe latex have been linked to kidney failure and other serious conditions. \n\n 7- Surgery: \n Aloe might affect blood sugar levels and could interfere with blood sugar control during and after surgery. Stop taking aloe at least 2 weeks before a scheduled surgery."
        }
    },
    {
        "basicInfo": {
            "plantName": "Mimosa pudica",
            "URLs": {
                "plantURL": "assets/MimosaPudica.jpg",
                "plantCircleURL": "assets/MimosaPudicaCircle.jpg"
            }
        },
        "description": {
            "familyDescription": "Fabaceae",
            "otherNameDescription": "Sleepy Plant, Action Plant, Dormilones, Touch-me-not, Shameplant, Honte, Memalu",
            "usedPartDescription": "Leaves, Roots, Stem, Bark"
        },
        "boxes": {
            "boxDescription": "Sensitive plant is a low-growing, much-branched, prickly, perennial shrub about 15-100 cm tall. Roots are cylindrical, tapering, with secondary and tertiary branches, varying in length up to 2-cm thick, surface more or less rough or longitudinally wrinkled; greyish-brown to brown, cut surface of pieces pale yellow, fracture hard, woody, bark-fibrous; odor, distinct; taste, slightly astringent. \nThe stem is woody at the base, stiff, cylindrical, reddish-brown or purple, pubescent and bears scattered prickles along the internodes. Prickles are 3-4 mm long, compressed, slightly curved, hard and very sharp.\nLeaves are dark green, bipinnate and hairy. The pinnae are in two pairs (sometimes only one pair) arising close together from the tip of the petiole so the arrangement appears palmate. The petiole is about 2.5 cm long and the pinnae are 2.5-5 cm long. There are 12-50 leaflets, each 6-12 mm long, 1.5 mm wide, oblong-linear and pointed, glabrous above but with a hairy margin and lower surface. The stipules are linear-lanceolate and 7-8 mm long. Leaflets and leaves fold up rapidly when touched and also close at night.\nFlower is bright purplish-pink along with four prominent stamens and occurs in globular or ovoid heads about 9 mm in diameter. The calyx is minute and the corolla is four-lobed and about 2 mm long. Peduncles, 12-25 mm long, arise from leaf axils, are densely hairy and carry prickles. The corolla is 2-2.3 mm long, and consists of four stamens. \nIt has bunched of 2-8 pods that are around 1.8 cm x 3-5 mm, densely thorny flocked and have prickled along their edges. Pods are oblong, flattened, recurved about 8-20 mm long and 2-6 mm wide containing 1-5 seeds. The pod is pointed at the apex, glabrous, edged with bristles and breaks into one-seeded segments which fall away from unbroken marginal sutures when mature. Seeds are light-brown, flattened, 2.5-3 mm in diameter and with a finely granular surface.",
            "boxNutritionalValue": "Nutrition value per 100 g:\n\n● Moisture Content 9.67%\n● Protein 8.37%\n● Fat 1.43%\n● Crude Fibre 3.30%\n● Total Carbohydrates 73.7%\n● Ascorbic Acid 13.5 mg\n● Thiamin 0.60 mg\n● Riboflavin 1.10 mg\n● Niacin 0.40 mg",
            "boxHealthBenefits": "1- Treats Wounds:\nThe methanolic extract of Mimosa pudica is essential for wound healing activity. This is due to the presence of phenols constituents.\n\n2- Antimicrobial:\nThere are several antimicrobial properties in Mimosa pudica such as terpenoids, flavonoids, glycosides, alkaloids, quinines, phenols, tannins, saponins, and coumarin. These properties enhance the antimicrobial activity of methanolic extract of Mimosa pudica against Aspergillus fumigatus and Citrobacter. \n\n3- Analgesic and Anti-inflammatory Properties:\nFlavonoids in Mimosa pudica ethanolic extract contributes to analgesic and anti-inflammatory properties. This dose-dependent extract is able to inhibit carrageenan-induced paw oedema, a model for inflammatory study. The effectiveness of the analgesic activity of Mimosa pudica ethanolic extract also was found to be more significant on the acetic acid-induced writhing model than the tail flick model. \n\n 4- Antidiarrhoeal Properties:\nDiarrhea is a condition of having three or more loose or liquid bowel movements per day. Antidiarrhoeal property in Mimosa pudica extract is tannin and flavonoids. This dose-dependent extract is able to inhibit diarrhea caused by castor oil induced diarrhea and PGE2 induced enteropooling. Mimosa pudica also able to reduce gastrointestinal motility after charcoal meal administration.\n\n 5- Antifertility Properties:\nMimosa pudica extract prolongs the length of the estrous cycle with a significant increase in the duration of the diestrous phase. The analysis of the principal hormones (Luteinizing hormone, Follicle-stimulating hormone, and prolactin, estradiol, and progesterone) involved in the regulation of the estrous cycle showed that the Mimosa pudica extract is able to alter gonadotropin release and estradiol secretion.\n\n6- Antimalarial Properties:\nMimosa pudica possesses antimalarial and antiplasmodial properties such as terpenoids, flavonoids, and alkaloids. With such properties, Mimosa pudica able to against odium berghei infections, one of the malaria cause diseases.\n\n7- Antihelminthes Properties:\nMimosa pudica extracts (aqueous and ethanol) reduce the paralysis and death time of worms in a dose-dependent manner. The phytochemicals of Mimosa pudica such as alkaloids, tannins, and phenols contributes to anthelmintic activity and alkaloids to act on the central nervous system which causes paralysis of the earthworm. These phytochemicals also can cause inhibition of tubulin polymerization, block glucose uptake, and damage mucopolysaccharide membrane of worms which will expose the outer layer and restrict the movement of earthworms that lead to paralysis and death.\n\n 8- Antiulcer Properties:\n  Mimosa pudica has antiulcer properties due to its flavonoids content. These properties reduce total acidity, ulcer index, and an increase in pH of gastric juice in pylorus ligated ulcer activity.\n\n9- Antivenom Properties:\n Mimosa pudica extract was capable of neutralizing the lethality induced by the venom. The cobra and krait venom showed the presence of phospholipase A2 enzymes by producing hemolytic haloes in indirect hemolytic assays. Mimosa pudica extract was capable of inhibiting phospholipase A2 dependent hemolysis of sheep RBCs in a dose-dependent manner. Thus, Mimosa pudica plant extract was found to be effective in the neutralization of edema induced by venoms.",
            "boxOtherUses": "- Mimosa pudica has the ability to fix nitrogen where it enhances competitive nodulation, nodule development, intracellular infection, and bacteroid persistence.\n\n - Mimosa pudica is able to conduct the most phytoremediation of arsenic-polluted soils caused by tin mines by bioaccumulating and extracting the pollutant into its leaves. \n\n- The delicately fragrant flowers can be crystallized or used in the preparation of distilled flower water. \n\n- The plant forms a dense ground cover and has been used to provide ground cover in coconut plantations. \n\n - The dried stem bark is used as a tonic in China and Japan.",
            "boxWarnings": "- It should not be consumed by pregnant and lactating women.\n\n- If taken in high quantities it can prove fatal.\n\n- Avoid using it if suffer from constipation or hypomenorrhea."
        }
    }
]